fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_СведенияОбОтпусках</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщаяПродолжительностьОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)
	
	ОтпускаСотрудниковПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ЗаполнитьСотрудниками(Команда)
	
	Если Объект.ОтпускаСотрудников.Количество() <> 0 Тогда
		
		Результат = Ждать ВопросАсинх(
			"Список сотрудников будет очищен. Продолжить?",
			РежимДиалогаВопрос.ДаНет, , , "Вопрос.");
		
		Если Результат = Неопределено 
			ИЛИ Результат = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Объект.ОтпускаСотрудников.Очистить();
	ЗаполнитьСотрудникамиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	АдресХранилища = ПоместитьДанныеВоВременноеХранилищеКлиент();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Адрес", АдресХранилища);
	
	ОткрытьФорму(
		"Документ.ВКМ_ГрафикОтпусков.Форма.ФормаАнализГрафика",
		ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Пересчитывает суммарную длительность отпусков по каждому сотруднику
// и записывает её в реквизит ОбщаяПродолжительностьОтпуска всех строк ТЧ.
// Вызывается при изменении любой строки табличной части ОтпускаСотрудников.
//
&НаСервере
Процедура ОтпускаСотрудниковПриИзмененииНаСервере()
	
	// Готовим таблицу-параметр
	СписокОтпусков = Объект.ОтпускаСотрудников.Выгрузить(
		, "Сотрудник,НомерСтроки,ДатаНачала,ДатаОкончания");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписокОтпусков.Сотрудник КАК Сотрудник,
		|	СписокОтпусков.НомерСтроки КАК НомерСтроки,
		|	РАЗНОСТЬДАТ(СписокОтпусков.ДатаНачала, СписокОтпусков.ДатаОкончания, ДЕНЬ) + 1 
		|		КАК ОбщаяПродолжительностьОтпуска
		|ПОМЕСТИТЬ ВТ_СписокОтпусков
		|ИЗ
		|	&СписокОтпусков КАК СписокОтпусков
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СписокОтпусков.Сотрудник КАК Сотрудник,
		|	СУММА(ВТ_СписокОтпусков.ОбщаяПродолжительностьОтпуска) 
		|		КАК ОбщаяПродолжительностьОтпуска
		|ПОМЕСТИТЬ ВТ_СписокСгруппированный
		|ИЗ
		|	ВТ_СписокОтпусков КАК ВТ_СписокОтпусков
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СписокОтпусков.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СписокОтпусков.НомерСтроки КАК НомерСтроки,
		|	ЕСТЬNULL(ВТ_СписокСгруппированный.ОбщаяПродолжительностьОтпуска, 0) 
		|		КАК ОбщаяПродолжительностьОтпуска
		|ИЗ
		|	ВТ_СписокОтпусков КАК ВТ_СписокОтпусков
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СписокСгруппированный КАК ВТ_СписокСгруппированный
		|		ПО ВТ_СписокОтпусков.Сотрудник = ВТ_СписокСгруппированный.Сотрудник";
	
	Запрос.УстановитьПараметр("СписокОтпусков", СписокОтпусков);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ИндексСтроки = Выборка.НомерСтроки - 1;
		
		// Проверяем, что индекс не выходит за границы
		Если ИндексСтроки >= 0 
			И ИндексСтроки < Объект.ОтпускаСотрудников.Количество() Тогда
			
			Объект.ОтпускаСотрудников[ИндексСтроки].ОбщаяПродолжительностьОтпуска = 
				Выборка.ОбщаяПродолжительностьОтпуска;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Клиентская обёртка для помещения ТЧ во временное хранилище.
// Нужна, потому что серверную функцию нельзя вызвать с клиента напрямую
// без директивы &НаСервереБезКонтекста или обёртки.
//
// Возвращаемое значение:
//   Строка - адрес во временном хранилище.
//
&НаКлиенте
Функция ПоместитьДанныеВоВременноеХранилищеКлиент()
	Возврат ПоместитьДанныеВоВременноеХранилище();
КонецФункции

&НаСервере
Функция ПоместитьДанныеВоВременноеХранилище()
	
	Возврат ПоместитьВоВременноеХранилище(
		Объект.ОтпускаСотрудников.Выгрузить(),
		УникальныйИдентификатор);
	
КонецФункции

// Заполняет табличную часть ОтпускаСотрудников всеми сотрудниками
&НаСервере
Процедура ЗаполнитьСотрудникамиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_Сотрудники.Ссылка КАК Сотрудник
		|ИЗ
		|	Справочник.ВКМ_Сотрудники КАК ВКМ_Сотрудники
		|ГДЕ
		|	НЕ ВКМ_Сотрудники.ПометкаУдаления
		|УПОРЯДОЧИТЬ ПО
		|	ВКМ_Сотрудники.Наименование";
	
	ТаблицаСотрудников = Запрос.Выполнить().Выгрузить();
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(
		ТаблицаСотрудников, Объект.ОтпускаСотрудников);
	
КонецПроцедуры

#КонецОбласти
